tap "cartr/qt4"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "spacehuhntech/huhnitor"
tap "teamookla/speedtest"
tap "zegervdv/zathura"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Console Matrix
brew "cmatrix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern replacement for 'ls'
brew "exa"
# Command-line downloader for image-hosting site galleries and collections
brew "gallery-dl", link: false
# Next-gen compiler infrastructure
brew "llvm"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# File browser
brew "ranger"
# Safe, concurrent, practical language
brew "rust"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Extraction utility for .zip compressed archives
brew "unzip"
# Show the current WiFi network password
brew "wifi-password"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# An intergalactic serial monitor for the ESP8266 Deauther
brew "spacehuhntech/huhnitor/huhnitor"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# PDF viewer
brew "zegervdv/zathura/zathura"
# DJVU plugin for zathura
brew "zegervdv/zathura/zathura-djvu"
# Poppler backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-poppler"
# Postscript backend plugin for zathura
brew "zegervdv/zathura/zathura-ps"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Voice and text chat software
cask "discord"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# GPU-based terminal emulator
cask "kitty"
# Messaging app with a focus on speed and security
cask "telegram"
