{
  "LspUI.nvim": { "branch": "main" },
  "LuaSnip": { "branch": "master" },
  "alpha-nvim": { "branch": "main" },
  "cellular-automaton.nvim": { "branch": "main" },
  "cloak.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "friendly-snippets": { "branch": "main" },
  "harpoon": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lsp-zero.nvim": { "branch": "v1.x" },
  "lspsaga.nvim": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-custom-diagnostic-highlight": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "playground": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "refactoring.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "tokyonight.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "undotree": { "branch": "master" },
  "vim-airline": { "branch": "master" },
  "vim-airline-themes": { "branch": "master" },
  "vim-commentary": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-multiple-cursors": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" },
  "vimtex": { "branch": "master" },
  "zen-mode.nvim": { "branch": "main" }
}